zilangchen/ND-Flexible-Sensor/FDC2214-2 (STM32+OLED+Blueteeth）/LT_STM32_Kit/LT_BSP/LT_LED/lt_led.h
#ifndef __LT_LED_H
#define	__LT_LED_H


#include "stm32f10x.h"

/********************************************移植修订点开始*****************************************************/
/* 定义LED1连接的GPIO端口, 用户只需要修改下面的代码即可改变控制的LED引脚 */
#define LED1_GPIO_PORT    	GPIOE		                /* GPIO端口 */
#define LED1_GPIO_CLK 	    RCC_APB2Periph_GPIOE		/* GPIO端口时钟 */
#define LED1_GPIO_PIN		    GPIO_Pin_2		
#define EN485_pin           GPIO_Pin_9
#define EN485_GPIO_PORT     GPIOE
#define EN485_GPIO_CLK 	    RCC_APB2Periph_GPIOE
/* 定义LED2连接的GPIO端口, 用户只需要修改下面的代码即可改变控制的LED引脚 */
#define LED2_GPIO_PORT    	GPIOB			              /* GPIO端口 */
#define LED2_GPIO_CLK 	    RCC_APB2Periph_GPIOB		/* GPIO端口时钟 */
#define LED2_GPIO_PIN		GPIO_Pin_3		

/* 触发电平*/
#define LED_TRI_LEVEL			0							/* 0:低电平触发   1:高电平触发 */
/********************************************移植修订点结束*****************************************************/


/** the macro definition to trigger the led on or off 
  * 1 - off
  *0 - on
  */
#if(LED_TRI_LEVEL == 0)
	#define ON  0
	#define OFF 1
#else
	#define ON  1
	#define OFF 0
#endif

/* 使用标准的固件库控制IO*/
#define LED1(a)	if (a)	\
					GPIO_SetBits(LED1_GPIO_PORT,LED1_GPIO_PIN);\
					else		\
					GPIO_ResetBits(LED1_GPIO_PORT,LED1_GPIO_PIN)

#define LED2(a)	if (a)	\
					GPIO_SetBits(LED2_GPIO_PORT,LED2_GPIO_PIN);\
					else		\
					GPIO_ResetBits(LED2_GPIO_PORT,LED2_GPIO_PIN)




/* 直接操作寄存器的方法控制IO */
#define	digitalHi(p,i)		{p->BSRR=i;}	 //输出为高电平		
#define digitalLo(p,i)		{p->BRR=i;}	 //输出低电平
#define digitalToggle(p,i) 	{p->ODR ^=i;} //输出反转状态


/* 定义控制IO的宏 */
#define LED1_TOGGLE		 	digitalToggle(LED1_GPIO_PORT,LED1_GPIO_PIN)
#define LED2_TOGGLE		 	digitalToggle(LED1_GPIO_PORT,LED1_GPIO_PIN)
#define EN485_TX        digitalHi(EN485_GPIO_PORT,EN485_pin)
#if(LED_TRI_LEVEL == 0) 
	#define LED1_OFF		digitalHi(LED1_GPIO_PORT,LED1_GPIO_PIN)
	#define LED1_ON			digitalLo(LED1_GPIO_PORT,LED1_GPIO_PIN)
#else
	#define LED1_OFF		digitalLo(LED1_GPIO_PORT,LED1_GPIO_PIN)
	#define LED1_ON			digitalHi(LED1_GPIO_PORT,LED1_GPIO_PIN)
#endif


//#define LED2_TOGGLE		 digitalToggle(LED2_GPIO_PORT,LED2_GPIO_PIN)
//#define LED2_OFF		   digitalHi(LED2_GPIO_PORT,LED2_GPIO_PIN)
//#define LED2_ON			   digitalLo(LED2_GPIO_PORT,LED2_GPIO_PIN)



void LED_GPIO_Config(void);

#endif /* __LED_H */
